

"""
FastAPI使うと以下でアプリ起動することになる
uvicorn main:app --reload
意味：uvicornエンジンに自分が作ったappをセットして起動する
appはwebサーバとしての能力が入ってる箱(実物/オブジェクト)。
uvicornはブラウザからリクエストを受けてappにレスポンスよろしくと投げる外箱(エンジン)。

main → main.py ファイル
app → その中の app オブジェクト
--reload → ファイル変更時に自動再起動（開発時のみ使用）

"""


#fastapi定義
from fastapi import FastAPI
"""
Q:fastapiインストールしたけどインポートいるのなんで？
A:
インストール (pip install fastapi):
あなたのPC（図書館）の中に、FastAPIという便利な道具一式をダウンロードして保存した状態。
でも、この段階ではまだ「いつでも使えるように保管されている」だけ。
もしインポートしなくても全部が最初から読み込まれていたら、プログラムを動かすたびに全ての道具を準備することになり、
メモリを大量に消費して動きがめちゃくちゃ重くなってしまうので、
必要なときに、必要な道具だけを呼び出す（importする）のがプログラミングの鉄則

インポート (from fastapi import FastAPI):
from fastapi:
たくさんある道具箱（ライブラリ）の中から、fastapi という名前の箱を選ぶ

import FastAPI:
その箱の中には色々な部品が入っているけど、今回はWebアプリの心臓部である FastAPI という部品だけを使う。
"""


app= FastAPI()  
"""
Q:app = FastAPI()の意味は？
A:app = FastAPI() というのは、FastAPIという設計図から、実際にWebアプリとして動く機能を持った 『実体（オブジェクト）』 を作り出しているコード。
この app オブジェクトには、URLの受け取りやエラー処理などの機能がすでにパッケージ化されている。
これを uvicorn main:app --reloadでuvicorn という実行エンジンに渡すことで、
ブラウザからのリクエストを app が処理できるようになり、通信が可能になる。
上記の記載で実行し、ブラウザを確認(アドレスバーに http://127.0.0.1:8000 と入力してエンター。)
でサーバーが反応していること({"detail":"Not Found"}が表示される)が分かる。
"""

@app.get("/")
#read_root関数定義
def read_root():
    return{"Hello world:webサーバとフロントエンドの通信に成功"}

"""
Q:@app.get("/")の意味は？
A:@ から始まる記述をプログラミング用語は「デコレータ」
app オブジェクト（Webアプリ本体）に対して、「トップページ（/）という『住所』宛てに、
『データをちょうだい（GET）』という方式で連絡が来たら、すぐ下のread_root関数を実行してね！」と予約をしている状態
@app.get はGET（ちょうだい）という種類のリクエストだけを受け付ける窓口。ブラウザで普通にページを開くときはこれ。
"/" (ルートパス)はサイトのトップページのこと（http://127.0.0.1:8000/）。
"/items": http://127.0.0.1:8000/items にアクセスしたときに反応する。
"""


@app.get("/test")
def show_test():
    return {"これはテスト用窓口です！"}



